betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rcm.c
         (#) LSI (low-speed internal), 32 KHz low consumption RC used as IWDT and/or RTC
             clock source.

         (#) HSE (high-speed external), 4 to 26 MHz crystal oscillator used directly or
             through the PLL as System clock source. Can be used also as RTC clock source.

         (#) LSE (low-speed external), 32 KHz oscillator used as RTC clock source.

         (#) PLL (clocked by HSI or HSE), featuring two different output clocks:
           (++) The first output is used to generate the high speed system clock (up to 168 MHz)
           (++) The second output is used to generate the clock for the USB OTG FS (48 MHz),
                the random analog generator (<=48 MHz) and the SDIO (<= 48 MHz).

         (#) CSS (Clock security system), once enable using the macro __DAL_RCM_CSS_ENABLE()
             and if a HSE clock failure occurs(HSE used directly or through PLL as System
             clock source), the System clocks automatically switched to HSI and an interrupt
             is generated if enabled. The interrupt is linked to the Cortex-M4 NMI
             (Non-Maskable Interrupt) exception vector.

         (#) MCO1 (microcontroller clock output), used to output HSI, LSE, HSE or PLL
             clock (through a configurable prescaler) on PA8 pin.

         (#) MCO2 (microcontroller clock output), used to output HSE, PLL, SYSCLK or PLLI2S
             clock (through a configurable prescaler) on PC9 pin.

    [..] System, AHB and APB busses clocks configuration
         (#) Several clock sources can be used to drive the System clock (SYSCLK): HSI,
             HSE and PLL.
             The AHB clock (HCLK) is derived from System clock through configurable
             prescaler and used to clock the CPU, memory and peripherals mapped
             on AHB bus (DMA, GPIO...). APB1 (PCLK1) and APB2 (PCLK2) clocks are derived
             from AHB clock through configurable prescalers and used to clock
             the peripherals mapped on these busses. You can use
             "DAL_RCM_GetSysClockFreq()" function to retrieve the frequencies of these clocks.

         (#) For the APM32F405xx/07xx and APM32F415/417xx devices, the maximum
             frequency of the SYSCLK and HCLK is 168 MHz, PCLK2 84 MHz and PCLK1 42 MHz.
             Depending on the device voltage range, the maximum frequency should
             be adapted accordingly (refer to the product datasheets for more details).

         (#) For the APM32F41xxx, the maximum frequency of the SYSCLK and HCLK is 100 MHz,
             PCLK2 100 MHz and PCLK1 50 MHz.
             Depending on the device voltage range, the maximum frequency should
             be adapted accordingly (refer to the product datasheets for more details).

@endverbatim
  * @{
  */

/**
  * @brief  Resets the RCM clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - HSI ON and used as system clock source
  *            - HSE and PLL OFF
  *            - AHB, APB1 and APB2 prescaler set to 1.
  *            - CSS, MCO1 and MCO2 OFF
  *            - All interrupts disabled
  * @note   This function doesn't modify the configuration of the
  *            - Peripheral clocks
  *            - LSI, LSE and RTC clocks
  * @retval DAL status
  */
__weak DAL_StatusTypeDef DAL_RCM_DeInit(void)
{
  return DAL_OK;
}

/**
  * @brief  Initializes the RCM Oscillators according to the specified parameters in the
  *         RCM_OscInitTypeDef.
  * @param  RCM_OscInitStruct pointer to an RCM_OscInitTypeDef structure that
  *         contains the configuration information for the RCM Oscillators.
  * @note   The PLL is not disabled when used as system clock.
  * @note   Transitions LSE Bypass to LSE On and LSE On to LSE Bypass are not
  *         supported by this API. User should request a transition to LSE Off
  *         first and then LSE On or LSE Bypass.
  * @note   Transition HSE Bypass to HSE On and HSE On to HSE Bypass are not
  *         supported by this API. User should request a transition to HSE Off
  *         first and then HSE On or HSE Bypass.
  * @retval DAL status
  */
__weak DAL_StatusTypeDef DAL_RCM_OscConfig(RCM_OscInitTypeDef  *RCM_OscInitStruct)
{
  uint32_t tickstart, pll_config;

  /* Check Null pointer */
  if(RCM_OscInitStruct == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_RCM_OSCILLATORTYPE(RCM_OscInitStruct->OscillatorType));
  /*------------------------------- HSE Configuration ------------------------*/
  if(((RCM_OscInitStruct->OscillatorType) & RCM_OSCILLATORTYPE_HSE) == RCM_OSCILLATORTYPE_HSE)
  {
    /* Check the parameters */
    ASSERT_PARAM(IS_RCM_HSE(RCM_OscInitStruct->HSEState));
    /* When the HSE is used as system clock or clock source for PLL in these cases HSE will not disabled */
#if defined(APM32F403xx) || defined(APM32F402xx)
    if((__DAL_RCM_GET_SYSCLK_SOURCE() == RCM_CFG_SCLKSELSTS_HSE) ||\
      ((__DAL_RCM_GET_SYSCLK_SOURCE() == RCM_CFG_SCLKSELSTS_PLL) && (__DAL_RCM_GET_PLL_OSCSOURCE() == RCM_PLLSOURCE_HSE)))
#else
    if((__DAL_RCM_GET_SYSCLK_SOURCE() == RCM_CFG_SCLKSELSTS_HSE) ||\
      ((__DAL_RCM_GET_SYSCLK_SOURCE() == RCM_CFG_SCLKSELSTS_PLL) && ((RCM->PLL1CFG & RCM_PLL1CFG_PLL1CLKS) == RCM_PLL1CFG_PLL1CLKS_HSE)))
#endif /* APM32F403xx || APM32F402xx */
    {
      if((__DAL_RCM_GET_FLAG(RCM_FLAG_HSERDY) != RESET) && (RCM_OscInitStruct->HSEState == RCM_HSE_OFF))
      {
        return DAL_ERROR;
      }
    }
    else
    {
      /* Set the new HSE configuration ---------------------------------------*/
      __DAL_RCM_HSE_CONFIG(RCM_OscInitStruct->HSEState);

      /* Check the HSE State */
      if((RCM_OscInitStruct->HSEState) != RCM_HSE_OFF)
      {
        /* Get Start Tick */
        tickstart = DAL_GetTick();

        /* Wait till HSE is ready */
        while(__DAL_RCM_GET_FLAG(RCM_FLAG_HSERDY) == RESET)
        {
          if((DAL_GetTick() - tickstart ) > HSE_TIMEOUT_VALUE)
          {
            return DAL_TIMEOUT;
          }
        }
      }
      else
      {
        /* Get Start Tick */
        tickstart = DAL_GetTick();

        /* Wait till HSE is bypassed or disabled */
        while(__DAL_RCM_GET_FLAG(RCM_FLAG_HSERDY) != RESET)
        {
          if((DAL_GetTick() - tickstart ) > HSE_TIMEOUT_VALUE)
          {
            return DAL_TIMEOUT;
          }
        }
      }
    }
  }
  /*----------------------------- HSI Configuration --------------------------*/
  if(((RCM_OscInitStruct->OscillatorType) & RCM_OSCILLATORTYPE_HSI) == RCM_OSCILLATORTYPE_HSI)
  {
    /* Check the parameters */
    ASSERT_PARAM(IS_RCM_HSI(RCM_OscInitStruct->HSIState));
    ASSERT_PARAM(IS_RCM_CALIBRATION_VALUE(RCM_OscInitStruct->HSICalibrationValue));

    /* Check if HSI is used as system clock or as PLL source when PLL is selected as system clock */
#if defined(APM32F403xx) || defined(APM32F402xx)
    if((__DAL_RCM_GET_SYSCLK_SOURCE() == RCM_CFG_SCLKSELSTS_HSI) ||\
      ((__DAL_RCM_GET_SYSCLK_SOURCE() == RCM_CFG_SCLKSELSTS_PLL) && (__DAL_RCM_GET_PLL_OSCSOURCE() == RCM_PLLSOURCE_HSI_DIV2)))
#else
    if((__DAL_RCM_GET_SYSCLK_SOURCE() == RCM_CFG_SCLKSELSTS_HSI) ||\
      ((__DAL_RCM_GET_SYSCLK_SOURCE() == RCM_CFG_SCLKSELSTS_PLL) && ((RCM->PLL1CFG & RCM_PLL1CFG_PLL1CLKS) == RCM_PLL1CFG_PLL1CLKS_HSI)))
#endif /* APM32F403xx || APM32F402xx */
    {
      /* When HSI is used as system clock it will not disabled */
      if((__DAL_RCM_GET_FLAG(RCM_FLAG_HSIRDY) != RESET) && (RCM_OscInitStruct->HSIState != RCM_HSI_ON))
      {
        return DAL_ERROR;
      }
      /* Otherwise, just the calibration is allowed */
      else
      {
        /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
        __DAL_RCM_HSI_CALIBRATIONVALUE_ADJUST(RCM_OscInitStruct->HSICalibrationValue);
      }
    }
    else
    {
      /* Check the HSI State */
      if((RCM_OscInitStruct->HSIState)!= RCM_HSI_OFF)
      {
        /* Enable the Internal High Speed oscillator (HSI). */
        __DAL_RCM_HSI_ENABLE();

        /* Get Start Tick*/
        tickstart = DAL_GetTick();

        /* Wait till HSI is ready */
        while(__DAL_RCM_GET_FLAG(RCM_FLAG_HSIRDY) == RESET)
        {
          if((DAL_GetTick() - tickstart ) > HSI_TIMEOUT_VALUE)
          {
            return DAL_TIMEOUT;
          }
        }

        /* Adjusts the Internal High Speed oscillator (HSI) calibration value. */
        __DAL_RCM_HSI_CALIBRATIONVALUE_ADJUST(RCM_OscInitStruct->HSICalibrationValue);
      }
      else
      {
        /* Disable the Internal High Speed oscillator (HSI). */
        __DAL_RCM_HSI_DISABLE();

        /* Get Start Tick*/
        tickstart = DAL_GetTick();

        /* Wait till HSI is ready */
        while(__DAL_RCM_GET_FLAG(RCM_FLAG_HSIRDY) != RESET)
        {
          if((DAL_GetTick() - tickstart ) > HSI_TIMEOUT_VALUE)
          {
            return DAL_TIMEOUT;
          }
        }
      }
    }
  }
  /*------------------------------ LSI Configuration -------------------------*/
  if(((RCM_OscInitStruct->OscillatorType) & RCM_OSCILLATORTYPE_LSI) == RCM_OSCILLATORTYPE_LSI)
  {
    /* Check the parameters */
    ASSERT_PARAM(IS_RCM_LSI(RCM_OscInitStruct->LSIState));

    /* Check the LSI State */
    if((RCM_OscInitStruct->LSIState)!= RCM_LSI_OFF)
    {
      /* Enable the Internal Low Speed oscillator (LSI). */
      __DAL_RCM_LSI_ENABLE();

      /* Get Start Tick*/
      tickstart = DAL_GetTick();

      /* Wait till LSI is ready */
      while(__DAL_RCM_GET_FLAG(RCM_FLAG_LSIRDY) == RESET)
      {
        if((DAL_GetTick() - tickstart ) > LSI_TIMEOUT_VALUE)
        {
          return DAL_TIMEOUT;
        }
      }
    }
    else
    {
      /* Disable the Internal Low Speed oscillator (LSI). */
      __DAL_RCM_LSI_DISABLE();

