betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rcm.c
      /* Get Start Tick */
      tickstart = DAL_GetTick();

      /* Wait till LSI is ready */
      while(__DAL_RCM_GET_FLAG(RCM_FLAG_LSIRDY) != RESET)
      {
        if((DAL_GetTick() - tickstart ) > LSI_TIMEOUT_VALUE)
        {
          return DAL_TIMEOUT;
        }
      }
    }
  }
  /*------------------------------ LSE Configuration -------------------------*/
  if(((RCM_OscInitStruct->OscillatorType) & RCM_OSCILLATORTYPE_LSE) == RCM_OSCILLATORTYPE_LSE)
  {
    FlagStatus       pwrclkchanged = RESET;

    /* Check the parameters */
    ASSERT_PARAM(IS_RCM_LSE(RCM_OscInitStruct->LSEState));

    /* Update LSE configuration in Backup Domain control register    */
    /* Requires to enable write access to Backup Domain of necessary */
    if(__DAL_RCM_PMU_IS_CLK_DISABLED())
    {
      __DAL_RCM_PMU_CLK_ENABLE();
      pwrclkchanged = SET;
    }

    if(DAL_IS_BIT_CLR(PMU->CTRL, PMU_CTRL_BPWEN))
    {
      /* Enable write access to Backup domain */
      SET_BIT(PMU->CTRL, PMU_CTRL_BPWEN);

      /* Wait for Backup domain Write protection disable */
      tickstart = DAL_GetTick();

      while(DAL_IS_BIT_CLR(PMU->CTRL, PMU_CTRL_BPWEN))
      {
        if((DAL_GetTick() - tickstart) > RCM_DBP_TIMEOUT_VALUE)
        {
          return DAL_TIMEOUT;
        }
      }
    }

    /* Set the new LSE configuration -----------------------------------------*/
    __DAL_RCM_LSE_CONFIG(RCM_OscInitStruct->LSEState);
    /* Check the LSE State */
    if((RCM_OscInitStruct->LSEState) != RCM_LSE_OFF)
    {
      /* Get Start Tick*/
      tickstart = DAL_GetTick();

      /* Wait till LSE is ready */
      while(__DAL_RCM_GET_FLAG(RCM_FLAG_LSERDY) == RESET)
      {
        if((DAL_GetTick() - tickstart ) > RCM_LSE_TIMEOUT_VALUE)
        {
          return DAL_TIMEOUT;
        }
      }
    }
    else
    {
      /* Get Start Tick */
      tickstart = DAL_GetTick();

      /* Wait till LSE is ready */
      while(__DAL_RCM_GET_FLAG(RCM_FLAG_LSERDY) != RESET)
      {
        if((DAL_GetTick() - tickstart ) > RCM_LSE_TIMEOUT_VALUE)
        {
          return DAL_TIMEOUT;
        }
      }
    }

    /* Restore clock configuration if changed */
    if(pwrclkchanged == SET)
    {
      __DAL_RCM_PMU_CLK_DISABLE();
    }
  }
  /*-------------------------------- PLL Configuration -----------------------*/
  /* Check the parameters */
  ASSERT_PARAM(IS_RCM_PLL(RCM_OscInitStruct->PLL.PLLState));
  if ((RCM_OscInitStruct->PLL.PLLState) != RCM_PLL_NONE)
  {
    /* Check if the PLL is used as system clock or not */
    if(__DAL_RCM_GET_SYSCLK_SOURCE() != RCM_CFG_SCLKSELSTS_PLL)
    {
      if((RCM_OscInitStruct->PLL.PLLState) == RCM_PLL_ON)
      {
        /* Check the parameters */
        ASSERT_PARAM(IS_RCM_PLLSOURCE(RCM_OscInitStruct->PLL.PLLSource));
#if defined(APM32F403xx) || defined(APM32F402xx)
        ASSERT_PARAM(IS_RCM_PLL_MUL(RCM_OscInitStruct->PLL.PLLMUL));
#else
        ASSERT_PARAM(IS_RCM_PLLB_VALUE(RCM_OscInitStruct->PLL.PLLB));
        ASSERT_PARAM(IS_RCM_PLL1A_VALUE(RCM_OscInitStruct->PLL.PLL1A));
        ASSERT_PARAM(IS_RCM_PLL1C_VALUE(RCM_OscInitStruct->PLL.PLL1C));
        ASSERT_PARAM(IS_RCM_PLLD_VALUE(RCM_OscInitStruct->PLL.PLLD));
#endif /* APM32F403xx || APM32F402xx */

        /* Disable the main PLL. */
        __DAL_RCM_PLL_DISABLE();

        /* Get Start Tick */
        tickstart = DAL_GetTick();

        /* Wait till PLL is ready */
        while(__DAL_RCM_GET_FLAG(RCM_FLAG_PLLRDY) != RESET)
        {
          if((DAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
          {
            return DAL_TIMEOUT;
          }
        }

#if defined(APM32F403xx) || defined(APM32F402xx)
        /* Configure the HSE prediv factor --------------------------------*/
        /* It can be written only when the PLL is disabled. Not used in PLL source is different than HSE */
        if (RCM_OscInitStruct->PLL.PLLSource == RCM_PLLSOURCE_HSE)
        {
          /* Check the parameter */
          ASSERT_PARAM(IS_RCM_HSE_PREDIV(RCM_OscInitStruct->HSEPredivValue));
          /* Set PREDIV1 Value */
          __DAL_RCM_HSE_PREDIV_CONFIG(RCM_OscInitStruct->HSEPredivValue);
        }

        /* Configure the main PLL clock source and multiplication factors. */
        __DAL_RCM_PLL_CONFIG(RCM_OscInitStruct->PLL.PLLSource,
                             RCM_OscInitStruct->PLL.PLLMUL);
#else
        /* Configure the main PLL clock source, multiplication and division factors. */
        WRITE_REG(RCM->PLL1CFG, (RCM_OscInitStruct->PLL.PLLSource                                            | \
                                 RCM_OscInitStruct->PLL.PLLB                                                 | \
                                 (RCM_OscInitStruct->PLL.PLL1A << RCM_PLL1CFG_PLL1A_Pos)             | \
                                 (((RCM_OscInitStruct->PLL.PLL1C >> 1U) - 1U) << RCM_PLL1CFG_PLL1C_Pos) | \
                                 (RCM_OscInitStruct->PLL.PLLD << RCM_PLL1CFG_PLLD_Pos)));
#endif /* APM32F403xx || APM32F402xx */

        /* Enable the main PLL. */
        __DAL_RCM_PLL_ENABLE();

        /* Get Start Tick */
        tickstart = DAL_GetTick();

        /* Wait till PLL is ready */
        while(__DAL_RCM_GET_FLAG(RCM_FLAG_PLLRDY) == RESET)
        {
          if((DAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
          {
            return DAL_TIMEOUT;
          }
        }
      }
      else
      {
        /* Disable the main PLL. */
        __DAL_RCM_PLL_DISABLE();

        /* Get Start Tick */
        tickstart = DAL_GetTick();

        /* Wait till PLL is ready */
        while(__DAL_RCM_GET_FLAG(RCM_FLAG_PLLRDY) != RESET)
        {
          if((DAL_GetTick() - tickstart ) > PLL_TIMEOUT_VALUE)
          {
            return DAL_TIMEOUT;
          }
        }
      }
    }
    else
    {
      /* Check if there is a request to disable the PLL used as System clock source */
      if((RCM_OscInitStruct->PLL.PLLState) == RCM_PLL_OFF)
      {
        return DAL_ERROR;
      }
      else
      {
#if defined(APM32F403xx) || defined(APM32F402xx)
        /* Do not return DAL_ERROR if request repeats the current configuration */
        pll_config = RCM->CFG;
        if ((READ_BIT(pll_config, RCM_CFG_PLLSRCSEL) != RCM_OscInitStruct->PLL.PLLSource) ||
            (READ_BIT(pll_config, RCM_CFG_PLLMULCFG) != RCM_OscInitStruct->PLL.PLLMUL))
#else
        /* Do not return DAL_ERROR if request repeats the current configuration */
        pll_config = RCM->PLL1CFG;
#if defined (RCM_PLL1CFG_PLLR)
        if (((RCM_OscInitStruct->PLL.PLLState) == RCM_PLL_OFF) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLL1CLKS) != RCM_OscInitStruct->PLL.PLLSource) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLLB) != (RCM_OscInitStruct->PLL.PLLB) << RCM_PLL1CFG_PLLB_Pos) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLL1A) != (RCM_OscInitStruct->PLL.PLL1A) << RCM_PLL1CFG_PLL1A_Pos) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLL1C) != (((RCM_OscInitStruct->PLL.PLL1C >> 1U) - 1U)) << RCM_PLL1CFG_PLL1C_Pos) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLLD) != (RCM_OscInitStruct->PLL.PLLD << RCM_PLL1CFG_PLLD_Pos)) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLLR) != (RCM_OscInitStruct->PLL.PLLR << RCM_PLL1CFG_PLLR_Pos)))
#else
        if (((RCM_OscInitStruct->PLL.PLLState) == RCM_PLL_OFF) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLL1CLKS) != RCM_OscInitStruct->PLL.PLLSource) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLLB) != (RCM_OscInitStruct->PLL.PLLB) << RCM_PLL1CFG_PLLB_Pos) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLL1A) != (RCM_OscInitStruct->PLL.PLL1A) << RCM_PLL1CFG_PLL1A_Pos) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLL1C) != (((RCM_OscInitStruct->PLL.PLL1C >> 1U) - 1U)) << RCM_PLL1CFG_PLL1C_Pos) ||
            (READ_BIT(pll_config, RCM_PLL1CFG_PLLD) != (RCM_OscInitStruct->PLL.PLLD << RCM_PLL1CFG_PLLD_Pos)))
#endif
#endif /* APM32F403xx || APM32F402xx */
        {
          return DAL_ERROR;
        }
      }
    }
  }
  return DAL_OK;
}

/**
  * @brief  Initializes the CPU, AHB and APB busses clocks according to the specified
  *         parameters in the RCM_ClkInitStruct.
  * @param  RCM_ClkInitStruct pointer to an RCM_OscInitTypeDef structure that
  *         contains the configuration information for the RCM peripheral.
  * @param  FLatency FLASH Latency, this parameter depend on device selected
  *
  * @note   The SystemCoreClock CMSIS variable is used to store System Clock Frequency
  *         and updated by DAL_RCM_GetHCLKFreq() function called within this function
  *
  * @note   The HSI is used (enabled by hardware) as system clock source after
  *         startup from Reset, wake-up from STOP and STANDBY mode, or in case
  *         of failure of the HSE used directly or indirectly as system clock
  *         (if the Clock Security System CSS is enabled).
  *
  * @note   A switch from one clock source to another occurs only if the target
  *         clock source is ready (clock stable after startup delay or PLL locked).
  *         If a clock source which is not yet ready is selected, the switch will
  *         occur when the clock source will be ready.
  *
  * @note   Depending on the device voltage range, the software has to set correctly
  *         HPRE[3:0] bits to ensure that HCLK not exceed the maximum allowed frequency
  *         (for more details refer to section above "Initialization/de-initialization functions")
  * @retval None
  */
DAL_StatusTypeDef DAL_RCM_ClockConfig(RCM_ClkInitTypeDef  *RCM_ClkInitStruct, uint32_t FLatency)
{
  uint32_t tickstart;

  /* Check Null pointer */
  if(RCM_ClkInitStruct == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_RCM_CLOCKTYPE(RCM_ClkInitStruct->ClockType));
  ASSERT_PARAM(IS_FLASH_LATENCY(FLatency));

  /* To correctly read data from FLASH memory, the number of wait states (LATENCY)
    must be correctly programmed according to the frequency of the CPU clock
    (HCLK) and the supply voltage of the device. */

