betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rcm.c
  /* Increasing the number of wait states because of higher CPU frequency */
  if(FLatency > __DAL_FLASH_GET_LATENCY())
  {
    /* Program the new number of wait states to the LATENCY bits in the FLASH_ACCTRL register */
    __DAL_FLASH_SET_LATENCY(FLatency);

    /* Check that the new number of wait states is taken into account to access the Flash
    memory by reading the FLASH_ACCTRL register */
    if(__DAL_FLASH_GET_LATENCY() != FLatency)
    {
      return DAL_ERROR;
    }
  }

  /*-------------------------- HCLK Configuration --------------------------*/
  if(((RCM_ClkInitStruct->ClockType) & RCM_CLOCKTYPE_HCLK) == RCM_CLOCKTYPE_HCLK)
  {
    /* Set the highest APBx dividers in order to ensure that we do not go through
       a non-spec phase whatever we decrease or increase HCLK. */
    if(((RCM_ClkInitStruct->ClockType) & RCM_CLOCKTYPE_PCLK1) == RCM_CLOCKTYPE_PCLK1)
    {
      MODIFY_REG(RCM->CFG, RCM_CFG_APB1PSC, RCM_HCLK_DIV16);
    }

    if(((RCM_ClkInitStruct->ClockType) & RCM_CLOCKTYPE_PCLK2) == RCM_CLOCKTYPE_PCLK2)
    {
      MODIFY_REG(RCM->CFG, RCM_CFG_APB2PSC, (RCM_HCLK_DIV16 << 3));
    }

    ASSERT_PARAM(IS_RCM_HCLK(RCM_ClkInitStruct->AHBCLKDivider));
    MODIFY_REG(RCM->CFG, RCM_CFG_AHBPSC, RCM_ClkInitStruct->AHBCLKDivider);
  }

  /*------------------------- SYSCLK Configuration ---------------------------*/
  if(((RCM_ClkInitStruct->ClockType) & RCM_CLOCKTYPE_SYSCLK) == RCM_CLOCKTYPE_SYSCLK)
  {
    ASSERT_PARAM(IS_RCM_SYSCLKSOURCE(RCM_ClkInitStruct->SYSCLKSource));

    /* HSE is selected as System Clock Source */
    if(RCM_ClkInitStruct->SYSCLKSource == RCM_SYSCLKSOURCE_HSE)
    {
      /* Check the HSE ready flag */
      if(__DAL_RCM_GET_FLAG(RCM_FLAG_HSERDY) == RESET)
      {
        return DAL_ERROR;
      }
    }
    /* PLL is selected as System Clock Source */
    else if(RCM_ClkInitStruct->SYSCLKSource == RCM_SYSCLKSOURCE_PLLCLK)
    {
      /* Check the PLL ready flag */
      if(__DAL_RCM_GET_FLAG(RCM_FLAG_PLLRDY) == RESET)
      {
        return DAL_ERROR;
      }
    }
    /* HSI is selected as System Clock Source */
    else
    {
      /* Check the HSI ready flag */
      if(__DAL_RCM_GET_FLAG(RCM_FLAG_HSIRDY) == RESET)
      {
        return DAL_ERROR;
      }
    }

    __DAL_RCM_SYSCLK_CONFIG(RCM_ClkInitStruct->SYSCLKSource);

    /* Get Start Tick */
    tickstart = DAL_GetTick();

    while (__DAL_RCM_GET_SYSCLK_SOURCE() != (RCM_ClkInitStruct->SYSCLKSource << RCM_CFG_SCLKSELSTS_Pos))
    {
      if ((DAL_GetTick() - tickstart) > CLOCKSWITCH_TIMEOUT_VALUE)
      {
        return DAL_TIMEOUT;
      }
    }
  }

  /* Decreasing the number of wait states because of lower CPU frequency */
  if(FLatency < __DAL_FLASH_GET_LATENCY())
  {
     /* Program the new number of wait states to the LATENCY bits in the FLASH_ACCTRL register */
    __DAL_FLASH_SET_LATENCY(FLatency);

    /* Check that the new number of wait states is taken into account to access the Flash
    memory by reading the FLASH_ACCTRL register */
    if(__DAL_FLASH_GET_LATENCY() != FLatency)
    {
      return DAL_ERROR;
    }
  }

  /*-------------------------- PCLK1 Configuration ---------------------------*/
  if(((RCM_ClkInitStruct->ClockType) & RCM_CLOCKTYPE_PCLK1) == RCM_CLOCKTYPE_PCLK1)
  {
    ASSERT_PARAM(IS_RCM_PCLK(RCM_ClkInitStruct->APB1CLKDivider));
    MODIFY_REG(RCM->CFG, RCM_CFG_APB1PSC, RCM_ClkInitStruct->APB1CLKDivider);
  }

  /*-------------------------- PCLK2 Configuration ---------------------------*/
  if(((RCM_ClkInitStruct->ClockType) & RCM_CLOCKTYPE_PCLK2) == RCM_CLOCKTYPE_PCLK2)
  {
    ASSERT_PARAM(IS_RCM_PCLK(RCM_ClkInitStruct->APB2CLKDivider));
    MODIFY_REG(RCM->CFG, RCM_CFG_APB2PSC, ((RCM_ClkInitStruct->APB2CLKDivider) << 3U));
  }

  /* Update the SystemCoreClock global variable */
  SystemCoreClock = DAL_RCM_GetSysClockFreq() >> AHBPrescTable[(RCM->CFG & RCM_CFG_AHBPSC)>> RCM_CFG_AHBPSC_Pos];

  /* Configure the source of time base considering new system clocks settings */
  DAL_InitTick (uwTickPrio);

  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup RCM_Exported_Functions_Group2 Peripheral Control functions
 *  @brief   RCM clocks control functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the RCM Clocks
    frequencies.

@endverbatim
  * @{
  */

/**
  * @brief  Selects the clock source to output on MCO1 pin(PA8) or on MCO2 pin(PC9).
  * @note   PA8/PC9 should be configured in alternate function mode.
  @if APM32F405xx || APM32F407xx || APM32F417xx || APM32F411xx || APM32F465xx
  * @param  RCM_MCOx specifies the output direction for the clock source.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCO1: Clock source to output on MCO1 pin(PA8).
  *            @arg RCM_MCO2: Clock source to output on MCO2 pin(PC9).
  * @param  RCM_MCOSource specifies the clock source to output.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCO1SOURCE_HSI: HSI clock selected as MCO1 source
  *            @arg RCM_MCO1SOURCE_LSE: LSE clock selected as MCO1 source
  *            @arg RCM_MCO1SOURCE_HSE: HSE clock selected as MCO1 source
  *            @arg RCM_MCO1SOURCE_PLLCLK: main PLL clock selected as MCO1 source
  *            @arg RCM_MCO2SOURCE_SYSCLK: System clock (SYSCLK) selected as MCO2 source
  *            @arg RCM_MCO2SOURCE_PLLI2SCLK: PLLI2S clock selected as MCO2 source, available for all APM32F4 devices except APM32F410xx
  *            @arg RCM_MCO2SOURCE_I2SCLK: I2SCLK clock selected as MCO2 source, available only for APM32F410Rx devices
  *            @arg RCM_MCO2SOURCE_HSE: HSE clock selected as MCO2 source
  *            @arg RCM_MCO2SOURCE_PLLCLK: main PLL clock selected as MCO2 source
  * @param  RCM_MCODiv specifies the MCOx prescaler.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCODIV_1: no division applied to MCOx clock
  *            @arg RCM_MCODIV_2: division by 2 applied to MCOx clock
  *            @arg RCM_MCODIV_3: division by 3 applied to MCOx clock
  *            @arg RCM_MCODIV_4: division by 4 applied to MCOx clock
  *            @arg RCM_MCODIV_5: division by 5 applied to MCOx clock
  @endif
  @if APM32F402/403xx
  * @param  RCM_MCOx specifies the output direction for the clock source.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCO1: Clock source to output on MCO1 pin(PA8).
  * @param  RCM_MCOSource specifies the clock source to output.
  *          This parameter can be one of the following values:
  *            @arg @ref RCM_MCO1SOURCE_NOCLOCK     No clock selected as MCO clock
  *            @arg @ref RCM_MCO1SOURCE_SYSCLK      System clock selected as MCO clock
  *            @arg @ref RCM_MCO1SOURCE_HSI         HSI selected as MCO clock
  *            @arg @ref RCM_MCO1SOURCE_HSE         HSE selected as MCO clock
  *            @arg @ref RCM_MCO1SOURCE_PLLCLK      PLL clock divided by 2 selected as MCO clock
  * @param  RCM_MCODiv specifies the MCOx prescaler.
  *          This parameter can be one of the following values:
  *            @arg RCM_MCODIV_1: no division applied to MCOx clock
  @endif
  * @note  For APM32F410Rx devices to output I2SCLK clock on MCO2 you should have
  *        at last one of the SPI clocks enabled (SPI1, SPI2 or SPI5).
  * @retval None
  */
void DAL_RCM_MCOConfig(uint32_t RCM_MCOx, uint32_t RCM_MCOSource, uint32_t RCM_MCODiv)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  /* Check the parameters */
  ASSERT_PARAM(IS_RCM_MCO(RCM_MCOx));
  ASSERT_PARAM(IS_RCM_MCODIV(RCM_MCODiv));
  /* RCM_MCO1 */
  if(RCM_MCOx == RCM_MCO1)
  {
    ASSERT_PARAM(IS_RCM_MCO1SOURCE(RCM_MCOSource));

    /* MCO1 Clock Enable */
    __MCO1_CLK_ENABLE();

#if defined(APM32F403xx) || defined(APM32F402xx)
    /* Configure the MCO1 pin in alternate function mode */
    GPIO_InitStruct.Pin = MCO1_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    DAL_GPIO_Init(MCO1_GPIO_PORT, &GPIO_InitStruct);

    /* Configure the MCO clock source */
    __DAL_RCM_MCO1_CONFIG(RCM_MCOSource, RCM_MCODiv);
#else
    /* Configure the MCO1 pin in alternate function mode */
    GPIO_InitStruct.Pin = MCO1_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
    DAL_GPIO_Init(MCO1_GPIO_PORT, &GPIO_InitStruct);

    /* Mask MCO1 and MCO1PRE[2:0] bits then Select MCO1 clock source and prescaler */
    MODIFY_REG(RCM->CFG, (RCM_CFG_MCO1SEL | RCM_CFG_MCO1PSC), (RCM_MCOSource | RCM_MCODiv));
#endif /* APM32F403xx || APM32F402xx */

   /* This RCM MCO1 enable feature is available only on APM32F410xx devices */
#if defined(RCM_CFG_MCO1EN)
    __DAL_RCM_MCO1_ENABLE();
#endif /* RCM_CFG_MCO1EN */
  }
#if defined(RCM_CFG_MCO2SEL)
  else
  {
    ASSERT_PARAM(IS_RCM_MCO2SOURCE(RCM_MCOSource));

    /* MCO2 Clock Enable */
    __MCO2_CLK_ENABLE();

    /* Configure the MCO2 pin in alternate function mode */
    GPIO_InitStruct.Pin = MCO2_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
    DAL_GPIO_Init(MCO2_GPIO_PORT, &GPIO_InitStruct);

    /* Mask MCO2 and MCO2PRE[2:0] bits then Select MCO2 clock source and prescaler */
    MODIFY_REG(RCM->CFG, (RCM_CFG_MCO2SEL | RCM_CFG_MCO2PSC), (RCM_MCOSource | (RCM_MCODiv << 3U)));

   /* This RCM MCO2 enable feature is available only on APM32F410Rx devices */
#if defined(RCM_CFG_MCO2EN)
    __DAL_RCM_MCO2_ENABLE();
#endif /* RCM_CFG_MCO2EN */
  }
#endif /* RCM_CFG_MCO2SEL */
}

/**
  * @brief  Enables the Clock Security System.
  * @note   If a failure is detected on the HSE oscillator clock, this oscillator
  *         is automatically disabled and an interrupt is generated to inform the
  *         software about the failure (Clock Security System Interrupt, CSSI),
  *         allowing the MCU to perform rescue operations. The CSSI is linked to
  *         the Cortex-M4 NMI (Non-Maskable Interrupt) exception vector.
  * @retval None
  */
void DAL_RCM_EnableCSS(void)
{
  *(__IO uint32_t *) RCM_CTRL_CSSEN_BB = (uint32_t)ENABLE;
}

/**
  * @brief  Disables the Clock Security System.
  * @retval None
  */
void DAL_RCM_DisableCSS(void)
{
  *(__IO uint32_t *) RCM_CTRL_CSSEN_BB = (uint32_t)DISABLE;
}

/**
  * @brief  Returns the SYSCLK frequency
  *
  * @note   The system frequency computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source:
  * @note     If SYSCLK source is HSI, function returns values based on HSI_VALUE(*)
  * @note     If SYSCLK source is HSE, function returns values based on HSE_VALUE(**)
  * @note     If SYSCLK source is PLL, function returns values based on HSE_VALUE(**)
  *           or HSI_VALUE(*) multiplied/divided by the PLL factors.
  * @note     (*) HSI_VALUE is a constant defined in apm32f4xx_dal_cfg.h file (default value
  *               16 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (**) HSE_VALUE is a constant defined in apm32f4xx_dal_cfg.h file (default value
  *                25 MHz), user has to ensure that HSE_VALUE is same as the real
  *                frequency of the crystal used. Otherwise, this function may
  *                have wrong result.
  *
  * @note   The result of this function could be not correct when using fractional
  *         value for HSE crystal.
  *
  * @note   This function can be used by the user application to compute the
  *         baudrate for the communication peripherals or configure other parameters.
  *
  * @note   Each time SYSCLK changes, this function must be called to update the
  *         right SYSCLK value. Otherwise, any configuration based on this function will be incorrect.
  *
  *
  * @retval SYSCLK frequency
  */
__weak uint32_t DAL_RCM_GetSysClockFreq(void)
{
#if defined(APM32F403xx) || defined(APM32F402xx)
  uint32_t pllmul = 0U, prediv = 0U;
#else
  uint32_t pllm = 0U, pllvco = 0U, pllp = 0U;
#endif /* APM32F403xx || APM32F402xx */
  uint32_t sysclockfreq = 0U;

  /* Get SYSCLK source -------------------------------------------------------*/
  switch (RCM->CFG & RCM_CFG_SCLKSELSTS)
  {
    case RCM_CFG_SCLKSELSTS_HSI:  /* HSI used as system clock source */
    {
      sysclockfreq = HSI_VALUE;
       break;
    }
    case RCM_CFG_SCLKSELSTS_HSE:  /* HSE used as system clock  source */
    {
      sysclockfreq = HSE_VALUE;
      break;
    }
    case RCM_CFG_SCLKSELSTS_PLL:  /* PLL used as system clock  source */
    {
#if defined(APM32F403xx) || defined(APM32F402xx)
      pllmul = (((RCM->CFG & RCM_CFG_PLLMULCFG) >> RCM_CFG_PLLMULCFG_Pos) + 2U) > 16U? 16U:\
                           (((RCM->CFG & RCM_CFG_PLLMULCFG) >> RCM_CFG_PLLMULCFG_Pos) + 2U);
      if((RCM->CFG & RCM_CFG_PLLSRCSEL) != RCM_PLLSOURCE_HSI_DIV2)
      {
        prediv = ((RCM->CFG & RCM_CFG_PLLHSEPSC) >> RCM_CFG_PLLHSEPSC_Pos) + 1;

        /* HSE used as PLL clock source : PLLCLK = HSE/PREDIV1 * PLLMUL */
        sysclockfreq = (uint32_t)((HSE_VALUE  * pllmul) / prediv);
      }
      else
      {
        /* HSI used as PLL clock source : PLLCLK = HSI/2 * PLLMUL */
        sysclockfreq = (uint32_t)((HSI_VALUE >> 1) * pllmul);
      }

#else
      /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLLB) * PLL1A
      SYSCLK = PLL_VCO / PLL1C */
      pllm = RCM->PLL1CFG & RCM_PLL1CFG_PLLB;
      if(__DAL_RCM_GET_PLL_OSCSOURCE() != RCM_PLLSOURCE_HSI)
      {
        /* HSE used as PLL clock source */
        pllvco = (uint32_t) ((((uint64_t) HSE_VALUE * ((uint64_t) ((RCM->PLL1CFG & RCM_PLL1CFG_PLL1A) >> RCM_PLL1CFG_PLL1A_Pos)))) / (uint64_t)pllm);
      }
      else
      {
        /* HSI used as PLL clock source */
        pllvco = (uint32_t) ((((uint64_t) HSI_VALUE * ((uint64_t) ((RCM->PLL1CFG & RCM_PLL1CFG_PLL1A) >> RCM_PLL1CFG_PLL1A_Pos)))) / (uint64_t)pllm);
      }
      pllp = ((((RCM->PLL1CFG & RCM_PLL1CFG_PLL1C) >> RCM_PLL1CFG_PLL1C_Pos) + 1U) *2U);

      sysclockfreq = pllvco/pllp;
#endif /* APM32F403xx || APM32F402xx */
      break;
    }
    default:
    {
      sysclockfreq = HSI_VALUE;
      break;
    }
  }
  return sysclockfreq;
}

/**
  * @brief  Returns the HCLK frequency
  * @note   Each time HCLK changes, this function must be called to update the
  *         right HCLK value. Otherwise, any configuration based on this function will be incorrect.
  *
  * @note   The SystemCoreClock CMSIS variable is used to store System Clock Frequency
  *         and updated within this function
  * @retval HCLK frequency
  */
uint32_t DAL_RCM_GetHCLKFreq(void)
{
  return SystemCoreClock;
}

/**
  * @brief  Returns the PCLK1 frequency
  * @note   Each time PCLK1 changes, this function must be called to update the
  *         right PCLK1 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK1 frequency
  */
uint32_t DAL_RCM_GetPCLK1Freq(void)
{
  /* Get HCLK source and Compute PCLK1 frequency ---------------------------*/
  return (DAL_RCM_GetHCLKFreq() >> APBPrescTable[(RCM->CFG & RCM_CFG_APB1PSC)>> RCM_CFG_APB1PSC_Pos]);
}

/**
  * @brief  Returns the PCLK2 frequency
  * @note   Each time PCLK2 changes, this function must be called to update the
  *         right PCLK2 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK2 frequency
  */
uint32_t DAL_RCM_GetPCLK2Freq(void)
{
  /* Get HCLK source and Compute PCLK2 frequency ---------------------------*/
  return (DAL_RCM_GetHCLKFreq()>> APBPrescTable[(RCM->CFG & RCM_CFG_APB2PSC)>> RCM_CFG_APB2PSC_Pos]);
}

/**
  * @brief  Configures the RCM_OscInitStruct according to the internal
  * RCM configuration registers.
  * @param  RCM_OscInitStruct pointer to an RCM_OscInitTypeDef structure that
  * will be configured.
  * @retval None
  */
__weak void DAL_RCM_GetOscConfig(RCM_OscInitTypeDef  *RCM_OscInitStruct)
{
  /* Set all possible values for the Oscillator type parameter ---------------*/
  RCM_OscInitStruct->OscillatorType = RCM_OSCILLATORTYPE_HSE | RCM_OSCILLATORTYPE_HSI | RCM_OSCILLATORTYPE_LSE | RCM_OSCILLATORTYPE_LSI;

  /* Get the HSE configuration -----------------------------------------------*/
  if((RCM->CTRL & RCM_CTRL_HSEBCFG) == RCM_CTRL_HSEBCFG)
  {
    RCM_OscInitStruct->HSEState = RCM_HSE_BYPASS;
  }
  else if((RCM->CTRL & RCM_CTRL_HSEEN) == RCM_CTRL_HSEEN)
  {
    RCM_OscInitStruct->HSEState = RCM_HSE_ON;
  }
  else
  {
    RCM_OscInitStruct->HSEState = RCM_HSE_OFF;
  }

  /* Get the HSI configuration -----------------------------------------------*/
  if((RCM->CTRL & RCM_CTRL_HSIEN) == RCM_CTRL_HSIEN)
  {
    RCM_OscInitStruct->HSIState = RCM_HSI_ON;
  }
  else
  {
    RCM_OscInitStruct->HSIState = RCM_HSI_OFF;
  }

  RCM_OscInitStruct->HSICalibrationValue = (uint32_t)((RCM->CTRL &RCM_CTRL_HSITRM) >> RCM_CTRL_HSITRM_Pos);

