betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rcm.c
  /* Get the LSE configuration -----------------------------------------------*/
  if((RCM->BDCTRL & RCM_BDCTRL_LSEBCFG) == RCM_BDCTRL_LSEBCFG)
  {
    RCM_OscInitStruct->LSEState = RCM_LSE_BYPASS;
  }
  else if((RCM->BDCTRL & RCM_BDCTRL_LSEEN) == RCM_BDCTRL_LSEEN)
  {
    RCM_OscInitStruct->LSEState = RCM_LSE_ON;
  }
  else
  {
    RCM_OscInitStruct->LSEState = RCM_LSE_OFF;
  }

  /* Get the LSI configuration -----------------------------------------------*/
  if((RCM->CSTS & RCM_CSTS_LSIEN) == RCM_CSTS_LSIEN)
  {
    RCM_OscInitStruct->LSIState = RCM_LSI_ON;
  }
  else
  {
    RCM_OscInitStruct->LSIState = RCM_LSI_OFF;
  }

  /* Get the PLL configuration -----------------------------------------------*/
  if((RCM->CTRL & RCM_CTRL_PLL1EN) == RCM_CTRL_PLL1EN)
  {
    RCM_OscInitStruct->PLL.PLLState = RCM_PLL_ON;
  }
  else
  {
    RCM_OscInitStruct->PLL.PLLState = RCM_PLL_OFF;
  }
#if defined(APM32F403xx) || defined(APM32F402xx)
  RCM_OscInitStruct->PLL.PLLSource = (uint32_t)(RCM->CFG & RCM_CFG_PLLSRCSEL);
  RCM_OscInitStruct->PLL.PLLMUL = (uint32_t)(RCM->CFG & RCM_CFG_PLLMULCFG);
#else
  RCM_OscInitStruct->PLL.PLLSource = (uint32_t)(RCM->PLL1CFG & RCM_PLL1CFG_PLL1CLKS);
  RCM_OscInitStruct->PLL.PLLB = (uint32_t)(RCM->PLL1CFG & RCM_PLL1CFG_PLLB);
  RCM_OscInitStruct->PLL.PLL1A = (uint32_t)((RCM->PLL1CFG & RCM_PLL1CFG_PLL1A) >> RCM_PLL1CFG_PLL1A_Pos);
  RCM_OscInitStruct->PLL.PLL1C = (uint32_t)((((RCM->PLL1CFG & RCM_PLL1CFG_PLL1C) + RCM_PLL1CFG_PLL1C_0) << 1U) >> RCM_PLL1CFG_PLL1C_Pos);
  RCM_OscInitStruct->PLL.PLLD = (uint32_t)((RCM->PLL1CFG & RCM_PLL1CFG_PLLD) >> RCM_PLL1CFG_PLLD_Pos);
#endif /* APM32F403xx || APM32F402xx */
}

/**
  * @brief  Configures the RCM_ClkInitStruct according to the internal
  * RCM configuration registers.
  * @param  RCM_ClkInitStruct pointer to an RCM_ClkInitTypeDef structure that
  * will be configured.
  * @param  pFLatency Pointer on the Flash Latency.
  * @retval None
  */
void DAL_RCM_GetClockConfig(RCM_ClkInitTypeDef  *RCM_ClkInitStruct, uint32_t *pFLatency)
{
  /* Set all possible values for the Clock type parameter --------------------*/
  RCM_ClkInitStruct->ClockType = RCM_CLOCKTYPE_SYSCLK | RCM_CLOCKTYPE_HCLK | RCM_CLOCKTYPE_PCLK1 | RCM_CLOCKTYPE_PCLK2;

  /* Get the SYSCLK configuration --------------------------------------------*/
  RCM_ClkInitStruct->SYSCLKSource = (uint32_t)(RCM->CFG & RCM_CFG_SCLKSEL);

  /* Get the HCLK configuration ----------------------------------------------*/
  RCM_ClkInitStruct->AHBCLKDivider = (uint32_t)(RCM->CFG & RCM_CFG_AHBPSC);

  /* Get the APB1 configuration ----------------------------------------------*/
  RCM_ClkInitStruct->APB1CLKDivider = (uint32_t)(RCM->CFG & RCM_CFG_APB1PSC);

  /* Get the APB2 configuration ----------------------------------------------*/
  RCM_ClkInitStruct->APB2CLKDivider = (uint32_t)((RCM->CFG & RCM_CFG_APB2PSC) >> 3U);

  /* Get the Flash Wait State (Latency) configuration ------------------------*/
#if defined(APM32F403xx) || defined(APM32F402xx)
  *pFLatency = (uint32_t)(FLASH->CTRL1 & (FLASH_CTRL1_WS02 | FLASH_CTRL1_WS34));
#else
  *pFLatency = (uint32_t)(FLASH->ACCTRL & FLASH_ACCTRL_WAITP);
#endif /* APM32F403xx || APM32F402xx */
}

/**
  * @brief This function handles the RCM CSS interrupt request.
  * @note This API should be called under the NMI_Handler().
  * @retval None
  */
void DAL_RCM_NMI_IRQHandler(void)
{
  /* Check RCM CSSF flag  */
  if(__DAL_RCM_GET_IT(RCM_IT_CSS))
  {
    /* RCM Clock Security System interrupt user callback */
    DAL_RCM_CSSCallback();

    /* Clear RCM CSS pending bit */
    __DAL_RCM_CLEAR_IT(RCM_IT_CSS);
  }
}

/**
  * @brief  RCM Clock Security System interrupt callback
  * @retval None
  */
__weak void DAL_RCM_CSSCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_RCM_CSSCallback could be implemented in the user file
   */
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* DAL_RCM_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

